Revit 2017 API
AssetProperties Class
Represents a set of asset property(s).
Namespace: Autodesk.Revit.Utility
Assembly: RevitAPI (in RevitAPI.dll) Version: 17.0.0.0 (17.0.484.0)
Syntax
C#
public class AssetProperties : AssetProperty
Visual Basic
Public Class AssetProperties _
	Inherits AssetProperty
Visual C++
public ref class AssetProperties : public AssetProperty
Inheritance Hierarchy
System.Object
 Autodesk.Revit.Utility.AssetProperty
 Autodesk.Revit.Utility.AssetProperties
 Autodesk.Revit.Utility.Asset
See Also
AssetProperties Members
Autodesk.Revit.Utility Namespace